Repository: nj22az/Vecka
Catalog: Vecka/*.lproj/Localizable.strings
Languages: th

# common.today
source: Today
th: วันนี้

# common.cancel
source: Cancel
th: ยกเลิก

# common.save
source: Save
th: บันทึก

# action.go_to_today
source: GO TO TODAY
th: ไปยังวันนี้

# note.create
source: Create Note
th: สร้างโน้ต

# note.add
source: Add Note
th: เพิ่มโน้ต

# note.edit
source: Edit
th: แก้ไข

# note.add_event
source: ADD EVENT
th: เพิ่มกิจกรรม

# note.your_event
source: YOUR EVENT
th: กิจกรรมของคุณ

# note.new_event
source: New Event
th: กิจกรรมใหม่

# note.event_title
source: Event Title
th: ชื่อกิจกรรม

# note.event_details
source: Details (optional)
th: รายละเอียด (ไม่บังคับ)

# note.event_date
source: Event Date
th: วันที่กิจกรรม

# note.untitled
source: Untitled
th: ไม่มีชื่อ

# time.days_short
source: d
th: ว

# time.today
source: TODAY
th: วันนี้

# time.day_singular
source: DAY
th: วัน

# time.day_plural
source: DAYS
th: วัน

# countdown.select
source: Select Countdown
th: เลือกนับถอยหลัง

# countdown.ago
source: AGO
th: ที่แล้ว

# countdown.left
source: LEFT
th: เหลือ

# weekday.mon
source: MON
th: จ

# weekday.tue
source: TUE
th: อ

# weekday.wed
source: WED
th: พ

# weekday.thu
source: THU
th: พฤ

# weekday.fri
source: FRI
th: ศ

# weekday.sat
source: SAT
th: ส

# weekday.sun
source: SUN
th: อา

# navigation.previous_week
source: Previous week
th: สัปดาห์ก่อน

# navigation.next_week
source: Next week
th: สัปดาห์หน้า

# accessibility.selected
source: selected
th: เลือกแล้ว

# accessibility.holiday
source: holiday
th: วันหยุด

# week.display
source: Week %d
th: สัปดาห์ที่ %d

# countdown.today
source: TODAY
th: วันนี้

# countdown.tomorrow
source: TOMORROW
th: พรุ่งนี้

# countdown.passed
source: PASSED
th: ผ่านไปแล้ว

# countdown.days
source: %d DAYS
th: %d วัน

# picker.favorites_count
source: Favorites %d/4
th: รายการโปรด %d/4

# picker.predefined
source: Predefined
th: สำเร็จรูป

# picker.custom_events
source: Custom Events
th: กิจกรรมที่กำหนดเอง

# picker.create_custom
source: Create Custom…
th: สร้างกิจกรรม…

# picker.favorite
source: Favorite
th: รายการโปรด

# picker.unfavorite
source: Unfavorite
th: ลบจากรายการโปรด

# picker.remove
source: Remove
th: ลบ

# picker.manage_events
source: Manage Events…
th: จัดการกิจกรรม…

# picker.reorder_favorites
source: Reorder Favorites…
th: จัดเรียงรายการโปรด…

# picker.no_customs_hint
source: No custom events yet.
th: ยังไม่มีกิจกรรมที่กำหนดเอง

# picker.add_favorites_hint
source: Add your frequently used events to Favorites for quick access.
th: เพิ่มกิจกรรมที่ใช้บ่อยเป็นรายการโปรดเพื่อเข้าถึงเร็วขึ้น

# picker.selected
source: Selected
th: ที่เลือก

# weather.high
source: High
th: สูงสุด

# weather.low
source: Low
th: ต่ำสุด

# weather.precipitation
source: Precipitation
th: ฝน

# weather.uv_index
source: UV Index
th: ดัชนี UV

# weather.wind
source: Wind
th: ลม

# weather.loading
source: Loading weather...
th: กำลังโหลดสภาพอากาศ...

# weather.tap_to_retry
source: Tap to retry
th: แตะเพื่อลองอีกครั้ง

# weather.error.no_location
source: Location not available
th: ไม่มีข้อมูลตำแหน่ง

# weather.error.permission_denied
source: Location permission required
th: ต้องการสิทธิ์ตำแหน่ง

# weather.error.fetch_failed
source: Unable to fetch weather
th: ไม่สามารถโหลดสภาพอากาศได้

# weather.enable_location
source: Enable location services to see the forecast
th: เปิดใช้งานตำแหน่ง

# weather.location_required
source: Weather requires location access to show forecasts for your area.
th: สภาพอากาศต้องการการเข้าถึงตำแหน่งเพื่อแสดงพยากรณ์อากาศสำหรับพื้นที่ของคุณ

# weather.open_settings
source: Open Settings
th: เปิดการตั้งค่า

# weather.condition.clear
source: Clear
th: แจ่มใส

# weather.condition.mostly_clear
source: Mostly Clear
th: แจ่มใสเป็นส่วนใหญ่

# weather.condition.partly_cloudy
source: Partly Cloudy
th: มีเมฆบางส่วน

# weather.condition.mostly_cloudy
source: Mostly Cloudy
th: มีเมฆเป็นส่วนใหญ่

# weather.condition.cloudy
source: Cloudy
th: มีเมฆมาก

# weather.condition.drizzle
source: Drizzle
th: ฝนละออง

# weather.condition.rain
source: Rain
th: ฝน

# weather.condition.heavy_rain
source: Heavy Rain
th: ฝนหนัก

# weather.condition.snow
source: Snow
th: หิมะ

# weather.condition.heavy_snow
source: Heavy Snow
th: หิมะหนัก

# weather.condition.flurries
source: Flurries
th: หิมะฟุ้ง

# weather.condition.blizzard
source: Blizzard
th: พายุหิมะ

# weather.condition.sleet
source: Sleet
th: ลูกเห็บ

# weather.condition.freezing_rain
source: Freezing Rain
th: ฝนเย็นจัด

# weather.condition.freezing_drizzle
source: Freezing Drizzle
th: ฝนละอองเย็นจัด

# weather.condition.wintry_mix
source: Wintry Mix
th: สภาพอากาศหนาว

# weather.condition.blowing_snow
source: Blowing Snow
th: หิมะปลิว

# weather.condition.isolated_thunderstorms
source: Isolated Thunderstorms
th: พายุฟ้าคะนองเฉพาะที่

# weather.condition.scattered_thunderstorms
source: Scattered Thunderstorms
th: พายุฟ้าคะนองกระจาย

# weather.condition.thunderstorms
source: Thunderstorms
th: พายุฟ้าคะนอง

# weather.condition.strong_storms
source: Strong Storms
th: พายุรุนแรง

# weather.condition.tropical_storm
source: Tropical Storm
th: พายุโซนร้อน

# weather.condition.hurricane
source: Hurricane
th: เฮอริเคน

# weather.condition.foggy
source: Foggy
th: มีหมอก

# weather.condition.haze
source: Haze
th: มีหมอกควัน

# weather.condition.smoky
source: Smoky
th: มีควัน

# weather.condition.windy
source: Windy
th: ลมแรง

# weather.condition.breezy
source: Breezy
th: ลมโชย

# weather.condition.hot
source: Hot
th: ร้อน

# weather.condition.frigid
source: Frigid
th: หนาวมาก

# weather.condition.hail
source: Hail
th: ลูกเห็บขนาดใหญ่

# weather.condition.sun_flurries
source: Sun Flurries
th: แดดและหิมะ

# weather.condition.sun_showers
source: Sun Showers
th: แดดและฝน

# weather.condition.blowing_dust
source: Blowing Dust
th: ฝุ่นพัด

# weather.condition.unknown
source: Conditions Vary
th: สภาพอากาศแปรปรวน

# expenses.title
source: Expenses
th: ค่าใช้จ่าย

# trips.title
source: Trips
th: การเดินทาง

# expenses.amount
source: Amount
th: จำนวนเงิน

# expenses.category
source: Category
th: หมวดหมู่

# expenses.details
source: Details
th: รายละเอียด

# expenses.receipt
source: Receipt
th: ใบเสร็จ

# expenses.exchange_rate
source: Exchange Rate
th: อัตราแลกเปลี่ยน

# expenses.converted_amount
source: Converted Amount
th: จำนวนเงินที่แปลงแล้ว

# expenses.currency_conversion
source: Currency Conversion
th: การแปลงสกุลเงิน

# expenses.notes
source: Notes (Optional)
th: หมายเหตุ (ไม่บังคับ)

# expenses.trip
source: Trip
th: การเดินทาง

# expenses.rate_for
source: Rate for
th: อัตราสำหรับ

# location.searching
source: Searching...
th: กำลังค้นหา...

# location.no_locations_found
source: No locations found
th: ไม่พบสถานที่

# location.search_results
source: Search Results
th: ผลการค้นหา

# location.quick_add
source: Quick Add
th: เพิ่มด่วน

# location.manual_entry
source: Manual Entry
th: ป้อนด้วยตนเอง

# location.manual_entry_hint
source: Enter coordinates in decimal degrees (e.g., 59.3293, 18.0686)
th: ป้อนพิกัดในรูปแบบทศนิยม (เช่น 59.3293, 18.0686)

# location.auto_detect
source: Auto-Detect
th: ตรวจหาอัตโนมัติ

# location.auto_detect_hint
source: Use your device's current location for weather forecasts
th: ใช้ตำแหน่งปัจจุบันของอุปกรณ์สำหรับพยากรณ์อากาศ

# location.saved_locations
source: Saved Locations
th: สถานที่ที่บันทึกไว้

# weather.loading_forecast
source: Loading forecast...
th: กำลังโหลดพยากรณ์อากาศ...

# weather.no_weather_data
source: No Weather Data
th: ไม่มีข้อมูลสภาพอากาศ

# holidays.title
source: Holidays
th: วันหยุด

# holidays.turn_on_hint
source: Turn on Holidays in the Holidays screen to see observances.
th: เปิดวันหยุดในหน้าวันหยุดเพื่อดูวันสำคัญ

# holidays.turn_on_above
source: Turn on Holidays above to see holidays.
th: เปิดวันหยุดด้านบนเพื่อดูวันหยุด

# holidays.add_observances
source: Add observances like birthdays or milestones.
th: เพิ่มวันสำคัญเช่นวันเกิดหรือเหตุการณ์สำคัญ

# holidays.add_custom
source: Add custom holidays with +, or adjust your region.
th: เพิ่มวันหยุดที่กำหนดเองด้วย + หรือปรับภูมิภาค

# pdf.export_type
source: Export Type
th: ประเภทการส่งออก

# pdf.date_selection
source: Date Selection
th: การเลือกวันที่

# pdf.export_options
source: Export Options
th: ตัวเลือกการส่งออก

# pdf.export_includes
source: Export includes selected data for the chosen date range
th: การส่งออกรวมข้อมูลที่เลือกสำหรับช่วงวันที่ที่เลือก

# pdf.loading_preview
source: Loading preview...
th: กำลังโหลดตัวอย่าง...

# pdf.activity_preview
source: Activity Preview
th: ตัวอย่างกิจกรรม

# pdf.select_options_hint
source: Select options to preview report content
th: เลือกตัวเลือกเพื่อดูตัวอย่างเนื้อหารายงาน

# pdf.preview
source: Preview
th: ตัวอย่าง

# pdf.preview_updates
source: Preview updates as you change options
th: ตัวอย่างจะอัปเดตเมื่อคุณเปลี่ยนตัวเลือก

# pdf.preview_unavailable
source: Preview unavailable
th: ตัวอย่างไม่พร้อมใช้งาน

# common.week
source: Week
th: สัปดาห์

# common.edit
source: Edit
th: แก้ไข

# dashboard.pinned
source: Pinned
th: ปักหมุด

# holiday.nyarsdagen
source: New Year's Day
th: วันปีใหม่

# holiday.trettondedag_jul
source: Epiphany
th: วันเทศกาลเทิดพระเจ้า

# holiday.forsta_maj
source: May 1st
th: วันที่ 1 พฤษภาคม

# holiday.sveriges_nationaldag
source: National Day of Sweden
th: วันชาติสวีเดน

# holiday.juldagen
source: Christmas Day
th: วันคริสต์มาส

# holiday.annandag_jul
source: Boxing Day
th: วันรุ่งคริสต์มาส

# holiday.nyarsafton
source: New Year's Eve
th: วันก่อนปีใหม่

# holiday.julafton
source: Christmas Eve
th: วันก่อนคริสต์มาส

# holiday.alla_hjartans_dag
source: Valentine's Day
th: วันวาเลนไทน์

# holiday.internationella_kvinnodagen
source: International Women's Day
th: วันสตรีสากล

# holiday.langfredagen
source: Good Friday
th: วันศุกร์ประเสริฐ

# holiday.paskdagen
source: Easter Sunday
th: วันอีสเตอร์

# holiday.annandag_pask
source: Easter Monday
th: วันจันทร์อีสเตอร์

# holiday.kristi_himmelsfardsdag
source: Ascension Day
th: วันเสด็จสู่สวรรค์

# holiday.pingstdagen
source: Pentecost
th: วันเพนเทคอสต์

# holiday.midsommardagen
source: Midsummer Day
th: วันกลางฤดูร้อน

# holiday.midsommarafton
source: Midsummer Eve
th: วันก่อนกลางฤดูร้อน

# holiday.alla_helgons_dag
source: All Saints' Day
th: วันสมโภชนักบุญทั้งหลาย

# holiday.mors_dag
source: Mother's Day
th: วันแม่

# holiday.fars_dag
source: Father's Day
th: วันพ่อ

# holiday.virdagjamning
source: Spring Equinox
th: วันเท่าราตรีฤดูใบไม้ผลิ

# holiday.sommarsolstand
source: Summer Solstice
th: วันเที่ยงแดดฤดูร้อน

# holiday.hostdagjamning
source: Autumn Equinox
th: วันเท่าราตรีฤดูใบไม้ร่วง

# holiday.vintersolstand
source: Winter Solstice
th: วันเที่ยงแดดฤดูหนาว

# countdown.custom_event
source: CUSTOM EVENT
th: กิจกรรมที่กำหนดเอง

# countdown.days_suffix
source: DAYS
th: วัน

# settings.region
source: Region
th: ภูมิภาค

# region.sweden
source: Sweden
th: สวีเดน

# region.us
source: United States
th: สหรัฐอเมริกา

# region.vietnam
source: Vietnam
th: เวียดนาม

# region.germany
source: Germany
th: เยอรมนี

# region.uk
source: United Kingdom
th: สหราชอาณาจักร

# region.france
source: France
th: ฝรั่งเศส

# region.italy
source: Italy
th: อิตาลี

# region.netherlands
source: Netherlands
th: เนเธอร์แลนด์

# region.japan
source: Japan
th: ญี่ปุ่น

# region.hongkong
source: Hong Kong
th: ฮ่องกง

# region.china
source: China
th: จีน

# region.thailand
source: Thailand
th: ไทย

# pdf.summary_title
source: Summary
th: สรุป

# pdf.recent_notes
source: Recent Notes
th: โน้ตล่าสุด

# pdf.recent_expenses
source: Recent Expenses
th: ค่าใช้จ่ายล่าสุด

# pdf.active_trips
source: Active Trips
th: การเดินทางที่ใช้งานอยู่

# pdf.holidays
source: Holidays
th: วันหยุด

# pdf.notes
source: Notes
th: โน้ต

# pdf.expenses
source: Expenses
th: ค่าใช้จ่าย

# pdf.week
source: Week
th: สัปดาห์

# pdf.generated_by
source: Generated by Onsen Planner
th: สร้างโดย Onsen Planner

# common.total
source: Total
th: รวม

# common.duration
source: Duration
th: ระยะเวลา

# common.category
source: Category
th: หมวดหมู่

# common.no_events
source: No events
th: ไม่มีกิจกรรม

# common.see_all
source: See All
th: ดูทั้งหมด

# common.try_again
source: Try Again
th: ลองอีกครั้ง

# common.retry
source: Retry
th: ลองใหม่

# common.refresh
source: Refresh
th: รีเฟรช

# common.options
source: Options
th: ตัวเลือก

# common.delete
source: Delete
th: ลบ

# common.settings
source: Settings
th: การตั้งค่า

# common.done
source: Done
th: เสร็จ

# common.none
source: None
th: ไม่มี

# common.show_all
source: Show All
th: แสดงทั้งหมด

# common.show_less
source: Show Less
th: แสดงน้อยลง

# common.more
source: More
th: เพิ่มเติม

# common.less
source: Less
th: น้อยลง

# contacts.no_contacts
source: No Contacts
th: ไม่มีผู้ติดต่อ

# contacts.import
source: Import from your address book or add contacts manually
th: นำเข้าจากสมุดรายชือหรือเพิ่มผู้ติดต่อด้วยตนเอง

# contacts.import_from_address_book
source: Import from Address Book
th: นำเข้าจากสมุดรายชื่อ

# contacts.import_options
source: Import Options
th: ตัวเลือกการนำเข้า

# contacts.new_contact
source: New Contact
th: ผู้ติดต่อใหม่

# contacts.import_all
source: Import All Contacts
th: นำเข้าผู้ติดต่อทั้งหมด

# contacts.select_to_import
source: Select Contacts to Import
th: เลือกผู้ติดต่อที่จะนำเข้า

# contacts.grant_permission
source: Grant Contacts Permission
th: อนุญาตการเข้าถึงผู้ติดต่อ

# contacts.export_to_ios
source: Export to iOS Contacts
th: ส่งออกไปยังผู้ติดต่อ iOS

# qr.scan_hint
source: Scan this QR code to save contact
th: สแกน QR code เพื่อบันทึกผู้ติดต่อ

# qr.point_camera
source: Point camera at QR code
th: ชี้กล้องไปที่ QR code

# qr.share
source: Share QR Code
th: แชร์ QR Code

# qr.share_as_qr
source: Share as QR Code
th: แชร์เป็น QR Code

# qr.share_as_vcard
source: Share as vCard
th: แชร์เป็น vCard

# trips.active
source: Active Trips
th: การเดินทางที่ใช้งานอยู่

# trips.upcoming
source: Upcoming Trips
th: การเดินทางที่กำลังจะมาถึง

# trips.add
source: Add Trip
th: เพิ่มการเดินทาง

# trips.generate_report
source: Generate Report
th: สร้างรายงาน

# trips.mileage
source: Mileage
th: ระยะทาง

# weather.no_data_title
source: No Weather Data
th: ไม่มีข้อมูลสภาพอากาศ

# weather.unable_to_load
source: Unable to Load Weather
th: ไม่สามารถโหลดสภาพอากาศได้

# weather.manage_locations
source: Manage Locations
th: จัดการสถานที่

# location.current
source: Current Location
th: ตำแหน่งปัจจุบัน

# location.add
source: Add Location
th: เพิ่มสถานที่

# location.enter_coordinates
source: Enter Coordinates Manually
th: ป้อนพิกัดด้วยตนเอง

# location.save
source: Save Location
th: บันทึกสถานที่

# expenses.add
source: Add Expense
th: เพิ่มค่าใช้จ่าย

# expenses.filter_options
source: Filter Options
th: ตัวเลือกการกรอง

# expenses.all_categories
source: All Categories
th: หมวดหมู่ทั้งหมด

# expenses.all_trips
source: All Trips
th: การเดินทางทั้งหมด

# expenses.use_template
source: Use Template
th: ใช้เทมเพลต

# expenses.remove_receipt
source: Remove Receipt
th: ลบใบเสร็จ

# expenses.add_receipt_photo
source: Add Receipt Photo
th: เพิ่มรูปภาพใบเสร็จ

# expenses.recent
source: Recent Expenses
th: ค่าใช้จ่ายล่าสุด

# notes.search
source: Search Notes
th: ค้นหาโน้ต

# notes.unpin
source: Unpin
th: ยกเลิกปักหมุด

# dashboard.upcoming_events
source: Upcoming Events
th: กิจกรรมที่กำลังจะมาถึง

# dashboard.no_activity
source: No Recent Activity
th: ไม่มีกิจกรรมล่าสุด

# navigation.detail_view
source: Detail View
th: มุมมองรายละเอียด

# navigation.calendar
source: Calendar
th: ปฏิทิน

# navigation.library
source: Library
th: คลัง

# navigation.notes
source: Notes
th: โน้ต

# navigation.holidays
source: Holidays
th: วันหยุด

# navigation.observances
source: Observances
th: วันสำคัญ

# navigation.contacts
source: Contacts
th: ผู้ติดต่อ

# navigation.expenses
source: Expenses
th: ค่าใช้จ่าย

# navigation.trips
source: Trips
th: การเดินทาง

# navigation.weather
source: Weather
th: สภาพอากาศ

# navigation.select_item
source: Select an item
th: เลือกรายการ

# navigation.menu
source: Menu
th: เมนู

# navigation.holidays_section
source: Holidays & Events
th: วันหยุดและกิจกรรม

# navigation.features
source: Features
th: ฟีเจอร์
